// ////////////////////////////////////////////////
//
// ОБРАЗЕЦ GULPFILE.JS
// Подробный комментарий...
// // /////////////////////////////////////////////

// ////////////////////////////////////////////////
//
// Требуемые плагины
//
// // /////////////////////////////////////////////
var gulp = require('gulp'),
    plugin1 = require('gulp-plugin1'),
    plugin2 = require('gulp-plugin2'),
    plugin3 = require('gulp-plugin3');

// ////////////////////////////////////////////////
//
// Создание переменных конфигурации
//
// ////////////////////////////////////////////////
var config = {
  html: [
    'path/to/html/files'
  ],
  scss:[
    'path/to/scss/files'
  ],
  scripts:[
    'path/to/script/files'
  ]
};

// ////////////////////////////////////////////////
//
// Задачи для стилей
//
// ///////////////////////////////////////////////
gulp.task('styles', function() {
  gulp.src(config.scss)
    .pipe( ... )
    . ...
    ;
});

// ////////////////////////////////////////////////
//
// Задачи для скриптов
//
// ///////////////////////////////////////////////
gulp.task('scripts', function() {
  return gulp.src(config.scripts)
    .pipe( ... )
    . ...
    ;
});

// ////////////////////////////////////////////////
//
// Задачи для HTML
//
// // /////////////////////////////////////////////
gulp.task('html', function(){
  gulp.src(config.html)
  .pipe( ... )
  . ...
  ;
});

// ////////////////////////////////////////////////
//
// Задачи для изображений
//
// // /////////////////////////////////////////////
gulp.task('images', function() {
  return gulp.src(config.images)
    .pipe(cache(imagemin()))
    . ...
    ;
});

// ////////////////////////////////////////////////
//
// Задачи Browser-Sync
//
// // /////////////////////////////////////////////
gulp.task('browser-sync', function() {
  browserSync({
    server: {
      baseDir: "./app/"
    }
  });
});

// ////////////////////////////////////////////////
//
// Задачи для очистки
//
// // /////////////////////////////////////////////
gulp.task('clean', function() {
  return gulp.src(['dist/styles', 'dist/scripts', 'dist/images'], {read: false})
    .pipe(clean());
});

// ////////////////////////////////////////////////
//
// Задачи сборки
//
// // /////////////////////////////////////////////

// задача запускает сервер для тестирования финального приложения
gulp.task('build:serve', function() {
  browserSync({
    server: {
      baseDir: "./build/"
    }
  });
});

// задача создаёт папку build для всех файлов
gulp.task('build:create', function(){
  //...
});

// задача удаляет ненужные файлы из папки build
gulp.task('build:remove', function () {
 // ...
);

// задача для запуска сборки
gulp.task('build', ['build:create', 'build:remove']);

// ////////////////////////////////////////////////
//
// Задача watch
//
// // /////////////////////////////////////////////
gulp.task ('watch', function(){
  gulp.watch(config.scss, ['styles']);
  gulp.watch(config.scripts, ['scripts']);
  gulp.watch(config.html, ['html']);
});

// ////////////////////////////////////////////////
//
// Задача по умолчанию
//
// // /////////////////////////////////////////////
gulp.task('default', ['scripts', 'styles', 'html', 'browser-sync', 'watch']);
